# -*- coding: utf-8 -*-
"""
-------------------------------------------------
   File Name：     data_analysis
   Description :   数据分析 numpy pandas SciPy
   Author :        Amadeus
   date：          2021/12/23
-------------------------------------------------
   Change Activity:
                   2021/12/23:
-------------------------------------------------
"""
"""
Numpy:表达N维数组的最基础库
-------------------------------------------------
Pandas：Python数据分析高层次应用库
--提供简单易用的数据结果和数据分析工具
--理解数据类型与索引的关系，操作索引即操作数据
--Python最主要的数据分析功能库，基于Numpy开发
Series = 索引 + 一维数据
DataFrame = 行列索引 + 二维数据
-------------------------------------------------
SciPy:数学、科学和工程计算功能库
--提供了一批数学算法及工程数据运算功能
--类似Matlab，可用于如傅里叶变换、信号处理等应用
--Python最主要的科学计算功能库，基于Numpy开发
"""
