# -*- coding: utf-8 -*-
"""
-------------------------------------------------
   File Name：     web_spider
   Description :   网络爬虫
   Author :        Amadeus
   date：          2021/12/23
-------------------------------------------------
   Change Activity:
                   2021/12/23:
-------------------------------------------------
Requests:最友好的网络爬虫功能库
--提供了简单易用的类HTTP协议网络爬虫功能
--支持连接池、SSL、Cookies、Http(s)代理等
--python最主要的页面级网络爬虫功能库
-------------------------------------------------
Scrapy:优秀的网络爬虫框架，Python数据分析的高层次应用库
--提供了构建网络爬虫系统的框架功能，功能半成品
--支持批量和定时网页爬取、提供数据处理流程等
--Python最主要最专业的网络爬虫框架
-------------------------------------------------
pyspider:强大的web页面爬取系统
--提供了完整的网页爬取系统构建功能
--支持数据库后端、消息队列、优先级、分布式架构等
--Python重要的网络爬虫类第三方库
-------------------------------------------------
Beautiful Soup: HTML和XML解析库
--提供了解析HTML和XML等Web信息的功能
--又名beautifulsoup4或bs4，可以加载多种解析引擎
--常与网络爬虫库搭配使用，如Scrapy, requests等
-------------------------------------------------
Re:正则表达式解析和处理功能库
--提供了定义和解析正则表达式的一批通用功能
--可用于各类场景，包括Web信息提取
--Python最主要的标准库之一，无需安装
-------------------------------------------------
Python-Goose：提取文章类型Web页面的功能库
--提供了对Web页面中文章信息/视频等元数据的提取功能
--针对特定类型的Web页面，应用覆盖面较广
--Python最主要的Web信息提取库
-------------------------------------------------
MyQR:二维码生成第三方库
--提供生成二维码的系列功能
--基于二维码、艺术二维码和动态二维码
"""



