# -*- coding: utf-8 -*-
"""
-------------------------------------------------
   File Name：     computational_thinking
   Description :    计算思维与程序设计
   Author :        Amadeus
   date：          2021/12/22
-------------------------------------------------
   Change Activity:
                   2021/12/22:
-------------------------------------------------
编程是将计算思维变成显示的过程
-------------------------------------------------
提高用户体验的方法
方法1：进度展示
方法2：异常处理
方法3：其他类方法
-打印输出：特定位置，输出程序运行的过程信息
-日志文件：对程序异常及用户使用进行定期记录
-帮助信息：给用户多种方式提供帮助信息
-------------------------------------------------
程序设计模式
IPO: I(INPUT) P(Process) O(OUTPUT)
自顶向下设计
模块化设计:松耦合 紧耦合
配置化设计：程序引擎 + 配置文件
           引擎 + 配置：程序执行和配置分离，将可选参数配置化
           将程序开发变成配置文件编写，扩展功能而不修改程序
           关键在于接口设计，清晰明了、灵活可扩展
-------------------------------------------------
从应用需求到软件产品
1.产品定义：对应用需求充分理解和明确定义
           不仅是功能定义，要考虑商业模式
2.系统架构：以系统方式思考产品的技术实现
           系统架构，关注数据流、模块化、体系架构
3.设计与实现：结合架构完成关键设计及系统实现
             结合可扩展性、灵活性等进行设计优化
4.用户体验：从用户角度思考应用效果
           用户至上，体验优先，以用户为中心
-------------------------------------------------

"""





